FrameOS/frameos/embedded/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# USB Serial/JTAG console (the S3 devkit's built-in USB port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Smaller, quieter image
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
